# ORM (Object-Relational Mapping) — технология программирования, которая связывает базы данных
# с концепциями объектно-ориентированных языков программирования. Проще говоря, это прослойка между базой данных
# и кодом, который пишет программист, которая позволяет оперировать сущностями БД, как созданными в программе объектами.


# Связываем python объекты с сущностями в базе данных
# ORM - способ доступа к реляционной базе данных с помощью объектно-ориентированного языка
# Все операции в коде преобразуются в SQL код

# Модели ORM — классы Python, которые соответствуют определению таблиц в базе данных и объектам,
# которые хранятся в этих таблицах.


# Преимущества:

# меньше кода
# SQL код генерируется автоматически
# единообразие кода, независимое от типа базы данных
# При необходимсоти можно кешировать запросы - получать ответ без запроса к БД

# Недостатки:

# Хуже производительность
# могут генерироваться неоптимальные запросы























































